from enum import Enum


class Command(Enum):
    QUIT = "q"
    HELP = "h"
    BUILD = "b"
    INFO = "i"


graph_title = "Міста та селища Обухівсього району Київської області"

coordinates = {
    "Обухів": (50.1103, 30.6299),
    "Таценки": (50.1640, 30.6714),
    "Козин": (50.2328, 30.6478),
    "Нові Безрадичі": (50.1899, 30.5874),
    "Романків": (50.2361, 30.5755),
    "Підгірці": (50.2458, 30.5489),
    "Старі Безрадичі": (50.1474, 30.5434),
    "Копачів": (50.1251, 30.4905),
    "Григорівка": (50.0466, 30.6203),
    "Гусачівка": (50.0463, 30.6465),
    "Матяшівка": (50.0241, 30.6320),
    "Слобідка": (50.0194, 30.5850),
    "Красне Перше": (50.0789, 30.6741),
    "Долина": (50.0575, 30.7008),
    "Дерев'яна": (50.1155, 30.6967),
    "Трипілля": (50.1159, 30.7778),
    "Халеп'я": (50.1128, 30.8220),
    "Витачів": (50.1147, 30.8773),
    "Стайки": (50.0757, 30.8992),
    "Українка": (50.1384, 30.7379),
    "Плюти": (50.1704, 30.7194),
}
